<a href="https://colab.research.google.com/github/ntdthanh1409/B-i-t-p-ch-ng-4/blob/master/B%E1%BA%A3n_sao_c%E1%BB%A7a_thuc_hanh_04.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

THỰC HÀNH LAMBDA - APPLY

1. Sử dụng bộ dữ liệu baseball.csv

In [2]:
import pandas as pd
df = pd.read_csv("baseball.csv")
df.head()

      id     player  year  stint team  lg  ...   so  ibb  hbp   sh   sf  gidp
0  88641  womacto01  2006      2  CHN  NL  ...  4.0  0.0  0.0  3.0  0.0   0.0
1  88643  schilcu01  2006      1  BOS  AL  ...  1.0  0.0  0.0  0.0  0.0   0.0
2  88645  myersmi01  2006      1  NYA  AL  ...  0.0  0.0  0.0  0.0  0.0   0.0
3  88649  helliri01  2006      1  MIL  NL  ...  2.0  0.0  0.0  0.0  0.0   0.0
4  88650  johnsra05  2006      1  NYA  AL  ...  4.0  0.0  0.0  0.0  0.0   0.0

[5 rows x 23 columns]

2. Hãy xây dựng hàm lambda theo công thức sau: $\frac{x + log(x)}{\sqrt(x)}$

In [3]:
#Code
import math
hs = lambda x: (x+ math.log(10))/(math.sqrt(10))
hs(4)

1.9930524040885318

3. Hãy thực thi hàm apply với lambda ở trên theo chiều ngang và chiều dọc đối với 1 Series do bạn chọn từ data frame ở bước 1

In [4]:
#Code
df['ab'] = df.apply(lambda x: (x['ab']+math.log(10))/(math.sqrt(10)), axis =1) 
df.head()

      id     player  year  stint team  lg  ...   so  ibb  hbp   sh   sf  gidp
0  88641  womacto01  2006      2  CHN  NL  ...  4.0  0.0  0.0  3.0  0.0   0.0
1  88643  schilcu01  2006      1  BOS  AL  ...  1.0  0.0  0.0  0.0  0.0   0.0
2  88645  myersmi01  2006      1  NYA  AL  ...  0.0  0.0  0.0  0.0  0.0   0.0
3  88649  helliri01  2006      1  MIL  NL  ...  2.0  0.0  0.0  0.0  0.0   0.0
4  88650  johnsra05  2006      1  NYA  AL  ...  4.0  0.0  0.0  0.0  0.0   0.0

[5 rows x 23 columns]

4. Hãy thực thi hàm apply với lambda ở trên theo chiều ngang và chiều dọc với 1 nhóm cột (hoặc có thể là toàn bộ) của data frame ở bước 1

In [6]:
#Coded
new_df = df[['year','r']]
new_df.apply(lambda x: (x+ math.log(10))/(math.sqrt(10)), axis = 0)

          year          r
0   635.081040   2.625508
1   635.081040   0.728141
2   635.081040   0.728141
3   635.081040   0.728141
4   635.081040   0.728141
..         ...        ...
95  635.397268   0.728141
96  635.397268   0.728141
97  635.397268  12.744796
98  635.397268  16.855757
99  635.397268   1.044369

[100 rows x 2 columns]

THỰC HÀNH APPLY VÀ HÀM TỰ XÂY DỰNG

Trong thực tế không phải lúc nào cũng sử dụng lambda với apply, mà có thể sử dụng apply với các hàm có sẵn khác hoặc do lập trình viên tự xây dựng.

1. Hãy áp dụng nhóm hàm sum, mean, sqrt, log của thư viện numpy cho data frame ở trên theo chiều ngang và chiều dọc

In [7]:
#Code
import numpy as np
df.apply(np.sum, axis = 0)

id                                                  8935266
player    womacto01schilcu01myersmi01helliri01johnsra05f...
year                                                 200692
stint                                                   113
team      CHNBOSNYAMILNYASFNARILANATLNYNTORTBAHOUARIATLM...
lg        NLALALNLALNLNLNLNLNLALALNLNLNLALNLNLNLNLALALNL...
g                                                      5238
ab                                                  1461.24
r                                                      1869
h                                                      3582
X2b                                                     739
X3b                                                      55
hr                                                      437
rbi                                                    1847
sb                                                      138
cs                                                       46
bb                                                     1549
so                                                     2408
ibb                                                     177
hbp                                                     112
sh                                                      138
sf                                                      120
gidp                                                    354
dtype: object

In [8]:
df[["year"]].apply(lambda x : np.mean(x), axis = 1)

0     2006.0
1     2006.0
2     2006.0
3     2006.0
4     2006.0
       ...
95    2007.0
96    2007.0
97    2007.0
98    2007.0
99    2007.0
Length: 100, dtype: float64

In [9]:
df[["year"]].apply(lambda x : np.sqrt(x), axis = 1)

         year
0   44.788391
1   44.788391
2   44.788391
3   44.788391
4   44.788391
..        ...
95  44.799554
96  44.799554
97  44.799554
98  44.799554
99  44.799554

[100 rows x 1 columns]

In [10]:
df[["year"]].apply(lambda x : np.log(x), axis = 1)

        year
0   7.603898
1   7.603898
2   7.603898
3   7.603898
4   7.603898
..       ...
95  7.604396
96  7.604396
97  7.604396
98  7.604396
99  7.604396

[100 rows x 1 columns]

2. Hãy xây dựng một hàm có tên là my_function có tham số đầu vào là x. Phương pháp tính toán của hàm như sau:
 (i) Nếu x >0  thì trả về log10(x); (ii) Nếu x <= 0  thì trả về $e^{x}$

In [11]:
#Code
import numpy as np
def function(x):
    if lambda x : x>0:
        return np.log10(x)
    else:
        return np.exp(x)
    return function(x)
x = int(input())
function(x)

5

0.6989700043360189

3. Hãy sử dụng hàm apply để gọi my_function áp dụng cho data frame ở bước 1 ở trên

In [12]:
#Code
df[["year"]].apply(lambda x : function(x), axis = 1)

        year
0   3.302331
1   3.302331
2   3.302331
3   3.302331
4   3.302331
..       ...
95  3.302547
96  3.302547
97  3.302547
98  3.302547
99  3.302547

[100 rows x 1 columns]